results/ycsb/write-heavy/tracing_ycsb_postgresql-13-default-write-heavy_0_6yJOWmXS/0_load.txt
bin/ycsb load jdbc -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p  db.user=benchant -p  db.passwd=benchANT2022 -p  db.driver=org.postgresql.Driver -p  db.batchsize=1000  -p  jdbc.batchupdateapi=true  -p db.url=jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.1 -p updateproportion=0.0 -p insertproportion=0.9 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/jdbc-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/binary/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/binary/ycsb/jdbc-binding/lib/commons-lang-2.4.jar:/binary/ycsb/jdbc-binding/lib/crate-jdbc-standalone-2.6.0.jar:/binary/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/binary/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/postgresql-42.2.5.jar:/binary/ycsb/jdbc-binding/lib/jdbc-binding-0.17.0.jar:/binary/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/binary/ycsb/jdbc-binding/lib/mariadb-java-client-3.0.5.jar:/binary/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/binary/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/mysql-connector-java-5.1.47-bin.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/jboss-common-jdbc-wrapper.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/c3p0-0.9.1-pre6.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/jboss-common-jdbc-wrapper-src.jar:/binary/ycsb/jdbc-binding/lib/mysql-connector-java-5.1.47/src/lib/slf4j-api-1.6.1.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -s -p db.user=benchant -p db.passwd=benchANT2022 -p db.driver=org.postgresql.Driver -p db.batchsize=1000 -p jdbc.batchupdateapi=true -p db.url=jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.1 -p updateproportion=0.0 -p insertproportion=0.9 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.JdbcDBClient -s -p db.user=benchant -p db.passwd=benchANT2022 -p db.driver=org.postgresql.Driver -p db.batchsize=1000 -p jdbc.batchupdateapi=true -p db.url=jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow -p workload=site.ycsb.workloads.CoreWorkload -threads 50 -p recordcount=2000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.1 -p updateproportion=0.0 -p insertproportion=0.9 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-01-17 13:25:38:037 0 sec: 0 operations; est completion in 0 second 
Adding shard node URL: jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow
Adding shard node URL: jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow
Adding shard node URL: jdbc:postgresql://172.31.23.176:5432/benchdb?sslmode=allow
[...]
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
Using shards: 1, batchSize:1000, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 1, batchSize:1000, fetchSize: -1

Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 1, batchSize:1000, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-01-17 13:25:48:015 10 sec: 99950 operations; 9995 current ops/sec; est completion in 3 minutes [INSERT: Count=99950, Max=7114751, Min=12, Avg=3195.87, 90=74, 99=1984, 99.9=62975, 99.99=6443007] 
2023-01-17 13:25:58:015 20 sec: 149950 operations; 5000 current ops/sec; est completion in 4 minutes [INSERT: Count=50000, Max=8765439, Min=12, Avg=6112.8, 90=23, 99=33, 99.9=196351, 99.99=7307263] 
2023-01-17 13:26:08:015 30 sec: 204950 operations; 5500 current ops/sec; est completion in 4 minutes [INSERT: Count=55000, Max=14106623, Min=12, Avg=11150.46, 90=23, 99=39, 99.9=159871, 99.99=12795903] 
2023-01-17 13:26:18:015 40 sec: 299950 operations; 9500 current ops/sec; est completion in 3 minutes [INSERT: Count=95000, Max=10059775, Min=12, Avg=6251.31, 90=15, 99=29, 99.9=87103, 99.99=7647231] 
2023-01-17 13:26:28:015 50 sec: 367705 operations; 6775.5 current ops/sec; est completion in 3 minutes [INSERT: Count=67777, Max=9789439, Min=12, Avg=7279.86, 90=18, 99=34, 99.9=176, 99.99=8667135] 
2023-01-17 13:26:38:015 60 sec: 437950 operations; 7024.5 current ops/sec; est completion in 3 minutes [INSERT: Count=70223, Max=8511487, Min=12, Avg=5872.8, 90=16, 99=33, 99.9=68223, 99.99=7417855] 
2023-01-17 13:26:48:015 70 sec: 526719 operations; 8876.9 current ops/sec; est completion in 3 minutes [INSERT: Count=88787, Max=9912319, Min=12, Avg=6853.62, 90=15, 99=27, 99.9=70463, 99.99=8503295] 
2023-01-17 13:26:58:015 80 sec: 600950 operations; 7423.1 current ops/sec; est completion in 3 minutes [INSERT: Count=74213, Max=9134079, Min=12, Avg=6884.85, 90=15, 99=37, 99.9=227, 99.99=8155135] 
2023-01-17 13:27:08:015 90 sec: 660138 operations; 5918.8 current ops/sec; est completion in 3 minutes [INSERT: Count=59211, Max=8478719, Min=12, Avg=6110.38, 90=17, 99=36, 99.9=4521983, 99.99=7106559] 
2023-01-17 13:27:18:015 100 sec: 741950 operations; 8181.2 current ops/sec; est completion in 2 minutes [INSERT: Count=81789, Max=10371071, Min=12, Avg=7514.49, 90=20, 99=35, 99.9=257, 99.99=9388031] 
2023-01-17 13:27:28:015 110 sec: 822950 operations; 8100 current ops/sec; est completion in 2 minutes [INSERT: Count=81000, Max=8560639, Min=12, Avg=6267.17, 90=18, 99=32, 99.9=63231, 99.99=7151615] 
2023-01-17 13:27:38:015 120 sec: 911950 operations; 8900 current ops/sec; est completion in 2 minutes [INSERT: Count=89000, Max=7598079, Min=12, Avg=5962.36, 90=15, 99=28, 99.9=52927, 99.99=6950911] 
2023-01-17 13:27:48:015 130 sec: 990950 operations; 7900 current ops/sec; est completion in 2 minutes [INSERT: Count=79000, Max=8822783, Min=12, Avg=5887.51, 90=15, 99=27, 99.9=427, 99.99=7000063] 
2023-01-17 13:27:58:015 140 sec: 1077950 operations; 8700 current ops/sec; est completion in 2 minutes [INSERT: Count=87000, Max=7770111, Min=12, Avg=5820.27, 90=15, 99=28, 99.9=206, 99.99=6565887] 
2023-01-17 13:28:08:015 150 sec: 1164950 operations; 8700 current ops/sec; est completion in 1 minute [INSERT: Count=87000, Max=7368703, Min=12, Avg=5828.86, 90=15, 99=28, 99.9=230, 99.99=6791167] 
2023-01-17 13:28:18:015 160 sec: 1246950 operations; 8200 current ops/sec; est completion in 1 minute [INSERT: Count=82000, Max=8265727, Min=12, Avg=6029.4, 90=22, 99=34, 99.9=53759, 99.99=7086079] 
2023-01-17 13:28:28:015 170 sec: 1330950 operations; 8400 current ops/sec; est completion in 1 minute [INSERT: Count=84000, Max=7741439, Min=12, Avg=5842.5, 90=16, 99=31, 99.9=163, 99.99=6590463] 
2023-01-17 13:28:38:015 180 sec: 1413950 operations; 8300 current ops/sec; est completion in 1 minute [INSERT: Count=83000, Max=7483391, Min=12, Avg=5842.45, 90=16, 99=30, 99.9=54623, 99.99=6746111] 
2023-01-17 13:28:48:015 190 sec: 1495950 operations; 8200 current ops/sec; est completion in 1 minute [INSERT: Count=82000, Max=7544831, Min=12, Avg=6209.31, 90=21, 99=33, 99.9=47071, 99.99=6979583] 
2023-01-17 13:28:58:015 200 sec: 1581950 operations; 8600 current ops/sec; est completion in 53 seconds [INSERT: Count=86000, Max=7725055, Min=12, Avg=5958.96, 90=15, 99=28, 99.9=271, 99.99=6864895] 
2023-01-17 13:29:08:015 210 sec: 1662950 operations; 8100 current ops/sec; est completion in 43 seconds [INSERT: Count=81000, Max=7761919, Min=12, Avg=5976.04, 90=15, 99=27, 99.9=48607, 99.99=6934527] 
2023-01-17 13:29:18:015 220 sec: 1748950 operations; 8600 current ops/sec; est completion in 32 seconds [INSERT: Count=86000, Max=7380991, Min=12, Avg=6035.13, 90=15, 99=26, 99.9=147, 99.99=6737919] 
2023-01-17 13:29:28:015 230 sec: 1827950 operations; 7900 current ops/sec; est completion in 22 seconds [INSERT: Count=79000, Max=8048639, Min=12, Avg=6045.73, 90=15, 99=29, 99.9=361, 99.99=6918143] 
2023-01-17 13:29:38:015 240 sec: 1911950 operations; 8400 current ops/sec; est completion in 12 seconds [INSERT: Count=84000, Max=7561215, Min=12, Avg=6154.09, 90=17, 99=30, 99.9=54815, 99.99=6955007] 
2023-01-17 13:29:48:015 250 sec: 1987959 operations; 7600.9 current ops/sec; est completion in 2 second [CLEANUP: Count=9, Max=588, Min=76, Avg=155.22, 90=132, 99=588, 99.9=588, 99.99=588] [INSERT: Count=76009, Max=7827455, Min=12, Avg=6735.13, 90=18, 99=35, 99.9=5017599, 99.99=7045119] 
2023-01-17 13:29:52:954 254 sec: 2000000 operations; 2437.94 current ops/sec; [CLEANUP: Count=41, Max=272, Min=72, Avg=100.88, 90=113, 99=272, 99.9=272, 99.99=272] [INSERT: Count=12041, Max=7483391, Min=12, Avg=20485.93, 90=24, 99=42, 99.9=5730303, 99.99=6991871] 
[OVERALL], RunTime(ms), 254939
[OVERALL], Throughput(ops/sec), 7845.013905287147
[TOTAL_GCS_PS_Scavenge], Count, 39
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1920
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.753121334907566
[TOTAL_GCS_PS_MarkSweep], Count, 4
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 354
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.1388567461235825
[TOTAL_GCs], Count, 43
[TOTAL_GC_TIME], Time(ms), 2274
[TOTAL_GC_TIME_%], Time(%), 0.8919780810311486
[CLEANUP], Operations, 50
[CLEANUP], AverageLatency(us), 110.66
[CLEANUP], MinLatency(us), 72
[CLEANUP], MaxLatency(us), 588
[CLEANUP], 95thPercentileLatency(us), 157
[CLEANUP], 99thPercentileLatency(us), 588
[INSERT], Operations, 2000000
[INSERT], AverageLatency(us), 6299.3742465
[INSERT], MinLatency(us), 12
[INSERT], MaxLatency(us), 14106623
[INSERT], 95thPercentileLatency(us), 24
[INSERT], 99thPercentileLatency(us), 65
[INSERT], Return=OK, 2000
[INSERT], Return=BATCHED_OK, 1998000